Revit 2026 API

# IPrintSettingPrintParameters Property

---

Returns the Parameters of Print Setup.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
PrintParameters PrintParameters { get; }
```
```vb
ReadOnly Property PrintParameters As PrintParameters
	Get
```
```cpp
property PrintParameters^ PrintParameters {
	PrintParameters^ get ();
}
```
```fsharp
abstract PrintParameters : PrintParameters with get
```

#### Property Value

PrintParameters

The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.

#### Reference

IPrintSetting Interface

Autodesk.Revit.DB Namespace